# Βάζω το random ωστε να εχω 20 τυχαιους αριθμους επειτα.
import random
n=int(input("ΔΩΣΕ ΕΝΑΝ ΑΚΕΡΑΙΟ ΘΕΤΙΚΟ ΑΡΙΘΜΟ")
a=0
b=1
if n<1:
    print("ΜΗ ΕΓΚΥΡΟΣ ΑΡΙΘΜΟΣ, ΔΩΣΕ ΘΕΤΙΚΟ ΑΚΕΡΑΙΟ ΜΕΓΑΛΥΤΕΡΟ Η ΙΣΟ ΤΟΥ 1")
elif n==1:
    print("Ο ΠΡΩΤΟΣ ΟΡΟΣ ΤΗΣ ΑΚΟΛΟΥΘΙΑΣ FIBONACCI ΕΙΝΑΙ ΤΟ 1 ΚΑΙ ΔΕΝ ΕΙΝΑΙ ΠΡΩΤΟΣ")
else:
    #Μετρητής κ για να τσεκάρω αν για 20 τυχαίους αριθμούς ισχύει το θεώρημα του Φερμά
	k=0
        #Επαναληπτική για να βρω τον ν-οστό όρο της ακολουθίας Fibonacci
	for i in range (2,n+1):
		c=a+b
		a=b
		b=c
        #Επαναληπτική για να τσεκάρω αν για 20 διαφορετικούς, τυχαίους αριθμούς ισχύει το θεώρημα Φερμά.
	for i in range (0,20):
		l=random.randint(0,99999999999999)
		if ((l**b)%b==l%b):
            #Αν ισχύει, αυξάνω τον μετρητή κατά 1
			k=k+1
    #Αν ο μετρητής είναι ίσος με 20 σημαίνει ότι για 20 διαφορετικούς αριθμούς ισχύει το θεώρημα φερμά άρα είναι και πρώτος ο αριθμός.
    if k==20:
        print("ΕΙΝΑΙ ΠΡΩΤΟΣ")
    else:
        print("ΔΕΝ ΕΙΝΑΙ ΠΡΩΤΟΣ")
        

